#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	//& - 按（2进制）位与
	//对应的二进制位进行与
	//规则：有0则1与0为0（有一个否即为否）
	int a = 3;
	int b = 5;
	int c = a & b;
	printf("c = %d\n", c);
	//
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000001
	//

	//| - 按（2进制）位或
	//对应的二进制位进行或
	//规则：有1则1|0为1（有一个是即为是）
	int d = a | b;
	printf("d = %d\n", d);
	//
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000111
	//
	
	//^ - 按（2进制）位异或
	//对应的二进制位进行异或
	//规则：相同为0，相异为1
	int e = a ^ b;
	printf("e = %d\n", e);
	//
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000110
	//

	//用^交换a，b
	printf("a = %d , b = %d\n", a, b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("a = %d , b = %d\n", a, b);


	//用&和>>计算一个整数存储在内存中的二进制中的1的个数
	int f = 13;
	//00000000000000000000000000001101
	//00000000000000000000000000000001
	//00000000000000000000000000000001
	int count = 0;
	int move = 0;
	for (move = 0; move <= 30; move++)
	{
		int g = 0;
		g = f & 1;
		if (g == 1)
		{
			count++;
		}
		f = f >> 1;
	}
	printf("%d\n", count);

	return 0;
}